In [5]:
import pandas as pd

In [2]:
df = pd.DataFrame(columns=["Name", "Age", "Height"])

In [3]:
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [60]:
df.loc[0] = ["Spark", 25, 173]
df

    Name  Age  Height
0  Spark   25     173

In [61]:
df.loc[1] = ["Faker", 28, 170]
df

    Name  Age  Height
0  Spark   25     173
1  Faker   28     170

In [62]:
df["Weight"] = [68, 59]
df

    Name  Age  Height  Weight
0  Spark   25     173      68
1  Faker   28     170      59

In [ ]:
# default -> axis=0 (row)
# drop不會直接刪除表格 需要宣告變數去接
df = df.drop("Weight", axis=1)
df

    Name  Age  Height
0  Spark   25     173
1  Faker   28     170

In [ ]:
df = df.drop(1)
df

    Name  Age  Height  Weight
0  Spark   25     173      68

In [ ]:
df2 = pd.DataFrame(
    data=[
        ("Allen", 22, 170),
        ("Spark", 25, 173),
        ("Faker", 25, 165),
    ],
    columns=["Name", "Age", "Height"]
)
df2

    Name  Age  Height
0  Allen   22     170
1  Spark   25     173
2  Faker   25     165